In [1]:
# Import NumPy package and load pandas
import numpy as np
import pandas as pd

## Transpose

In [2]:
dict = {'col' : {'R1':1.2,'R2':2.2}, 'col2':{'R1':3.2,'R2':4.2, 'R3':5.5}}
df = pd.DataFrame(dict)
df

    col  col2
R1  1.2   3.2
R2  2.2   4.2
R3  NaN   5.5

In [3]:
print('Columns ',df.columns)
print('Rows = ',df.index)

Columns  Index(['col', 'col2'], dtype='object')
Rows =  Index(['R1', 'R2', 'R3'], dtype='object')

In [4]:
df_transpose = df.T
df_transpose

       R1   R2   R3
col   1.2  2.2  NaN
col2  3.2  4.2  5.5

In [5]:
print('Columns ',df_transpose.columns)
print('Rows = ',df_transpose.index)

Columns  Index(['R1', 'R2', 'R3'], dtype='object')
Rows =  Index(['col', 'col2'], dtype='object')

## Rearrange columns in specific order

In [6]:
dict= {
    'col1' : [1,2,3,4],
    'col3' : [5,6,7,8],
    'col2' : ['A','B','C','D'],
    'col4' : ['X','Y','Z','D']
}
df = pd.DataFrame(dict, index = ['R1', 'R2', 'R3', 'R4'])
df

    col1  col3 col2 col4
R1     1     5    A    X
R2     2     6    B    Y
R3     3     7    C    Z
R4     4     8    D    D

Arranging dataframe columns in specific order by specifing a sequence.

In [7]:
df_order = pd.DataFrame(df, columns=['col1', 'col2', 'col3', 'col4'])
df_order

    col1 col2  col3 col4
R1     1    A     5    X
R2     2    B     6    Y
R3     3    C     7    Z
R4     4    D     8    D

# Add, Update and Delete columns

In [8]:
df_order['col5'] = 0
df_order

    col1 col2  col3 col4  col5
R1     1    A     5    X     0
R2     2    B     6    Y     0
R3     3    C     7    Z     0
R4     4    D     8    D     0

If you pass a column that isnâ€™t contained, it will appear with values that assigned

In [9]:
df_order1 = pd.DataFrame(df, columns=['col0','col1', 'col2', 'col3', 'col4', 'col5'])
df_order1

    col0  col1 col2  col3 col4  col5
R1   NaN     1    A     5    X   NaN
R2   NaN     2    B     6    Y   NaN
R3   NaN     3    C     7    Z   NaN
R4   NaN     4    D     8    D   NaN

Here column that passed not contained, it will appear with missing values

Update column values with array

In [10]:
df_order1['col5'] = np.arange(4)
df_order1

    col0  col1 col2  col3 col4  col5
R1   NaN     1    A     5    X     0
R2   NaN     2    B     6    Y     1
R3   NaN     3    C     7    Z     2
R4   NaN     4    D     8    D     3

Update the column value in the dataframe with Series.

In [11]:
values = pd.Series([1.8, 1.7], index=['R1', 'R3'])
df_order1['col0'] = values
df_order1

    col0  col1 col2  col3 col4  col5
R1   1.8     1    A     5    X     0
R2   NaN     2    B     6    Y     1
R3   1.7     3    C     7    Z     2
R4   NaN     4    D     8    D     3

Adding new column with result of operation on exisitng column.

In [12]:
df_order1['col_even'] = df_order1['col1'] % 2 == 0
df_order1

    col0  col1 col2  col3 col4  col5  col_even
R1   1.8     1    A     5    X     0     False
R2   NaN     2    B     6    Y     1      True
R3   1.7     3    C     7    Z     2     False
R4   NaN     4    D     8    D     3      True

Delete exisitng column in dataframe using .del method

In [13]:
del df_order1['col_even']
df_order1.columns

Index(['col0', 'col1', 'col2', 'col3', 'col4', 'col5'], dtype='object')

Adding new column by using map function with a dictonary or function

In [14]:
products = pd.DataFrame(
  {'product':['P1', 'P2','P3'], 'price':[450.,55.66,67.25]}
)
products

  product   price
0      P1  450.00
1      P2   55.66
2      P3   67.25

In [15]:
productCategory = {'P1' : 'C2', 'P2' : 'C3', 'P3' : 'C2', }
products['category'] = products['product'].map(productCategory)
products

  product   price category
0      P1  450.00       C2
1      P2   55.66       C3
2      P3   67.25       C2

# Reindexing
Reindex can alter either the (row) index, columns, or both.

In [16]:
df = pd.DataFrame(np.arange(9).reshape((3,3)), index = ('r1', 'r3', 'r4'), columns= ['col1','col3','col4'])
df

    col1  col3  col4
r1     0     1     2
r3     3     4     5
r4     6     7     8

Reindex the rows of the dataframe by passing sequence to reindex method.

In [17]:
df_rows = df.reindex(['r1', 'r2' ,'r3', 'r4']) 
df_rows

    col1  col3  col4
r1   0.0   1.0   2.0
r2   NaN   NaN   NaN
r3   3.0   4.0   5.0
r4   6.0   7.0   8.0

 Reindex the columns of the dataframe with 'columns' keyword to reindex method

In [18]:
df_cols = df.reindex(columns=['col1','col2' ,'col3','col4'])
df_cols

    col1  col2  col3  col4
r1     0   NaN     1     2
r3     3   NaN     4     5
r4     6   NaN     7     8

Reindex both the rows,columns of the dataframe

In [19]:
df_reindex = df.reindex(index = ['r1', 'r2' ,'r3', 'r4'], columns = ['col1','col2' ,'col3','col4'])
df_reindex

    col1  col2  col3  col4
r1   0.0   NaN   1.0   2.0
r2   NaN   NaN   NaN   NaN
r3   3.0   NaN   4.0   5.0
r4   6.0   NaN   7.0   8.0

In [20]:
# filling the missing values by 0 
df.reindex(
    index = ['r1', 'r2' ,'r3', 'r4'], 
    columns = ['col1','col2' ,'col3','col4'],
    fill_value = 0
)

    col1  col2  col3  col4
r1     0     0     1     2
r2     0     0     0     0
r3     3     0     4     5
r4     6     0     7     8

# Renaming Axis Indexes (row & column name)

In [21]:
df = pd.DataFrame(np.arange(12).reshape((3,4)), index = ('r1', 'r3', 'r4'), columns= ['col1','col2','col3','col4'])
df

    col1  col2  col3  col4
r1     0     1     2     3
r3     4     5     6     7
r4     8     9    10    11

Create a transformed version of a dataframe by renaming the index.

In [22]:
# create a transformed version of a dataframe in-place using map function
df.index = df.index.map(lambda x: x.upper()) 
df

    col1  col2  col3  col4
R1     0     1     2     3
R3     4     5     6     7
R4     8     9    10    11

Create a transformed version of a dataframe by renaming the columns.

In [23]:
df.rename(index=str.title, columns=str.upper)

    COL1  COL2  COL3  COL4
R1     0     1     2     3
R3     4     5     6     7
R4     8     9    10    11

create a transformed version of a dataframe renaming the rows and columns.

In [24]:
df.rename(index={'R3':'R2', 'R4':'R2'}, columns={'col1':'COL-01'})

    COL-01  col2  col3  col4
R1       0     1     2     3
R2       4     5     6     7
R2       8     9    10    11

In [25]:
df

    col1  col2  col3  col4
R1     0     1     2     3
R3     4     5     6     7
R4     8     9    10    11

#### Note :  rename() method returns a new object.  Using 'in-place' will modify the calling object without a copy

In [26]:
df.rename(index={'R3':'R2', 'R4':'R2'}, columns={'col1':'COL-01'} , inplace=True)
df

    COL-01  col2  col3  col4
R1       0     1     2     3
R2       4     5     6     7
R2       8     9    10    11

# Removing Duplicates

In [27]:
df = pd.DataFrame(
  {'col1': ['one', 'two'] * 3 + ['two'],
  'col2': [1, 1, 2, 3, 3, 4, 4]}
)
df

  col1  col2
0  one     1
1  two     1
2  one     2
3  two     3
4  one     3
5  two     4
6  two     4

In [28]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

Returns a boolean Series indicating whether all the items in row is same as previous row.

In [29]:
df.drop_duplicates() # Return dataframe without duplicates

  col1  col2
0  one     1
1  two     1
2  one     2
3  two     3
4  one     3
5  two     4

Remove duplicates with respect to specifed column.

In [30]:
df.drop_duplicates(['col2'])

  col1  col2
0  one     1
2  one     2
3  two     3
5  two     4

If you want get the last observed value instead of the first occurance using keep='last' option

In [31]:
df.drop_duplicates(['col1', 'col2'], keep='last')

  col1  col2
0  one     1
1  two     1
2  one     2
3  two     3
4  one     3
6  two     4

# Dropping elements

In [32]:
df = pd.DataFrame(np.arange(16).reshape((4,4)), index = ('r1','r2', 'r3', 'r4'), columns= ['col1','col2','col3','col4'])
df

    col1  col2  col3  col4
r1     0     1     2     3
r2     4     5     6     7
r3     8     9    10    11
r4    12    13    14    15

Calling drop with a sequence of labels will drop values from the row labels

In [33]:
df.drop(['r2', 'r4'])

    col1  col2  col3  col4
r1     0     1     2     3
r3     8     9    10    11

Drop values from the columns by passing axis=1 or axis='columns'

In [34]:
df.drop('col2', axis=1)

    col1  col3  col4
r1     0     2     3
r2     4     6     7
r3     8    10    11
r4    12    14    15

In [35]:
df.drop(['col2', 'col4'], axis='columns')

    col1  col3
r1     0     2
r2     4     6
r3     8    10
r4    12    14

In [36]:
df

    col1  col2  col3  col4
r1     0     1     2     3
r2     4     5     6     7
r3     8     9    10    11
r4    12    13    14    15

Note : drop() method returns a new object. Using 'in-place' will modify the calling object without a copy

Drop the record without returning new object

In [37]:
df.drop(['r1', 'r2'], inplace=True)
df

    col1  col2  col3  col4
r3     8     9    10    11
r4    12    13    14    15

# Sorting

In [38]:
df = pd.DataFrame(np.arange(8).reshape((2, 4)),
                  index=['three', 'one'],columns=['d', 'a', 'b', 'c'])
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [39]:
df.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [40]:
df.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

Note: Data is sorted in ascending order by default, but can be sorted in descending order.

In [41]:
df.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [42]:
df.sort_values(by='b')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [43]:
df.sort_values(by=['c','a'])

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [44]:
df[(np.abs(df) > 2)]

         d    a    b  c
three  NaN  NaN  NaN  3
one    4.0  5.0  6.0  7

# Discretization and Binning
Filtering or transforming outliers

In [45]:
df = pd.DataFrame(np.random.randn(5,6))
df

          0         1         2         3         4         5
0  0.576009  1.314938 -0.332224 -0.774086 -0.387400 -0.892322
1 -0.905041 -0.638478  0.908975 -0.154467 -0.163210 -1.134477
2  0.987199  0.400887 -0.059329 -0.446152 -1.849691  0.009549
3  0.194563 -0.696976 -0.215079  2.886809 -0.990715  0.209707
4 -0.093109  0.029129  1.738876  1.335018 -0.535059 -0.349805

In [46]:
# Finding the values (absolute value) greater than 2
df[(np.abs(df) > 2).any(1)]

          0         1         2         3         4         5
3  0.194563 -0.696976 -0.215079  2.886809 -0.990715  0.209707

In [47]:
df[(np.abs(df) > 2)]

    0   1   2         3   4   5
0 NaN NaN NaN       NaN NaN NaN
1 NaN NaN NaN       NaN NaN NaN
2 NaN NaN NaN       NaN NaN NaN
3 NaN NaN NaN  2.886809 NaN NaN
4 NaN NaN NaN       NaN NaN NaN

In [48]:
# Finding the values (absolute value) greater than 2 in the specifed columns 
df[3][np.abs(df[0]) > 1]

Series([], Name: 3, dtype: float64)

np.sign(data) produces 1 and â€“1 values based on whether the values in data are positive or negative.

In [49]:
df[(np.abs(df) > 2)] = np.sign(df) * 2 
df

          0         1         2         3         4         5
0  0.576009  1.314938 -0.332224 -0.774086 -0.387400 -0.892322
1 -0.905041 -0.638478  0.908975 -0.154467 -0.163210 -1.134477
2  0.987199  0.400887 -0.059329 -0.446152 -1.849691  0.009549
3  0.194563 -0.696976 -0.215079  2.000000 -0.990715  0.209707
4 -0.093109  0.029129  1.738876  1.335018 -0.535059 -0.349805

In [50]:
np.sign(df)

     0    1    2    3    4    5
0  1.0  1.0 -1.0 -1.0 -1.0 -1.0
1 -1.0 -1.0  1.0 -1.0 -1.0 -1.0
2  1.0  1.0 -1.0 -1.0 -1.0  1.0
3  1.0 -1.0 -1.0  1.0 -1.0  1.0
4 -1.0  1.0  1.0  1.0 -1.0 -1.0